common/models/Customer.php

SELECT * FROM `customer` WHERE (`username`='phamngocson@yahoo.com') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);