api/models/Customer.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);
---
SELECT * FROM `customer` WHERE `auth_key`='fot3eQN2s0Coqe3DU14-uOHArlbdixxw'