api/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);
---
SELECT * FROM `user` WHERE `auth_key`='AWiQ1UW9-BryGezkegZ8A0zOh7iMhhCD1'