api/forms/FetchRealestateForm.php

    protected function createCommand()
    {
        $command = Realestate::find();
---
SELECT * FROM `realestate`