api/forms/SignupForm.php

INSERT INTO `customer` (`name`, `username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('phamngocson@yahoo.com', 'phamngocson@yahoo.com', 'phamngocson@yahoo.com', '$2y$13$MoSf4Kokrug2ISFfSrHB2u7tSYowMAwB9D3Gj7DURlqkftTOyvIC6', '97HI_VQdqz_qqAbXcyWTVZzjtdcLBAeS', 10, '2019-01-29 09:46:46', '2019-01-29 09:46:46')
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new Customer();
        $user->name = $this->email;
        $user->username = $this->email;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        if ($this->isNeedConfirm()) {
            $user->status = Customer::STATUS_INACTIVE;
        } else {
            $user->status = Customer::STATUS_ACTIVE;
        }
        return $user->save() ? $user : null;